[{"title":"某天醒来我发现进入了一个地球人的身体","date":"2023-03-22T15:13:20.000Z","path":"/2023/03/22/某天醒来我发现进入了一个地球人的身体/","excerpt":"某天醒来之后发现我进入了一个地球人的身体，我在学习如何控制它——自我使用说明书gibl！完蛋了，我发现我进入了一个地球人的身体里了。 我得学着掌控这副身体。 1.容易疲惫[1]，等一颗叫太阳的恒星绕到这个星球的背面时，这个身体最好开始入睡。（备注：就是关掉发光装置，把可见光采集端口上面的肌肉滑下来，进入一种休眠状态） [1]疲惫，意识输出处于一种不连续的状态，无法有效的操控躯体。一般进入休眠状态（7&#x2F;该行星自转时间）以上既可以恢复。 2.需要摄入一定的能量维持大脑（身体上部的意识载体的球体）和躯体的移动等任务。 3.同我们电子元件构成的躯体不同，身体是一种由碳元素为主构成的系统，身体各个部分的系统间产生的信号传回大脑时，会产生不同的波动，他们称这个叫”情绪“。 4.情绪是一种我们世界不存在的东西，我也是花了很长时间才对这个东西有一点把握。对于他们的语言系统我还不是太熟练，没办法将这个东西用更具体的文字描述出来。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/Qiyongchuan/hexopp/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"SpringBoot （二） MVC","date":"2023-03-17T04:43:55.000Z","path":"/2023/03/17/SpringBoot-MVC/","excerpt":"1.MVC模型 M：model，模型层，和数据库打交道。《&#x3D;&#x3D;MyBatis V：view，视图层。用户看到的页面结果。 《&#x3D;&#x3D; Thymeleafs模板语言 C：controller，控制层。实现业务逻辑：数据的处理和页面的跳转。《&#x3D;&#x3D;Spring MVC 2.RequestMapping注解(Annotation)基于注解驱动的开发 将用户的url地址，与控制器中某个方法映射（Mapping）起来 多个request映射请求，可以映射同一个方法，一个请求不能映射多个方法 映射过程中，可以使用通配符（？，*） 映射可以是多级映射 &#96;&#96;&#96;httphttp://localhost:8080/study/hello/h1 http://localhost:8080/study/admin/user/edit即restful风格http://localhoost:8080/study/client/book/buy 123456789```shell@Controllerpublic class HelloController &#123; @ResponseBody @RequestMapping(&quot;hello1&quot;) public String hello1()&#123; return &quot;Hello, world!&quot;; &#125; @RequestMapping(“hello1”) 映射关系，当输入http://localhost:8080/study/hello1 中的hello1 @ResponseBody 响应体 返回的内容 123456789@ResponseBody @RequestMapping(&quot;hello2&quot;) public String hello2()&#123; String str=&quot;&quot;; for (int i = 1 ;i &lt;=5 ; i++)&#123; str += &quot;&lt;h&quot;+i+&quot;&gt;Hello,world!&lt;/h&quot;+i+&quot;&gt;&quot;; &#125; return str; &#125; 注意：RequestMapping(“xx”) 映射关系只能一个控制器（controller） 123456789101112@Controllerpublic class HelloController &#123; @ResponseBody @RequestMapping(&quot;hi&quot;) public String hello1()&#123; return &quot;Hello, world!&quot;; &#125; @ResponseBody @RequestMapping(&quot;hi&quot;) public String hello3()&#123; return &quot;Hello, world!&quot;; &#125; 报错信息 1234Caused by: java.lang.IllegalStateException: Ambiguous mapping. Cannot map &#x27;helloController&#x27; method public java.lang.String edu.hue.jk.controller.HelloController.hello1()to &#123; /hi&#125;: There is already &#x27;helloController&#x27; bean methodpublic java.lang.String edu.hue.jk.controller.HelloController.hello3() mapped.","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://github.com/Qiyongchuan/hexopp/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"},{"name":"SpringBoot笔记","slug":"SpringBoot笔记","permalink":"https://github.com/Qiyongchuan/hexopp/tags/SpringBoot%E7%AC%94%E8%AE%B0/"}]},{"title":"什么是服务器、网站服务器、文件服务器？","date":"2023-03-14T04:10:24.000Z","path":"/2023/03/14/什么是服务器、网站服务器、文件服务器？/","excerpt":"什么是服务器、网站服务器、文件服务器？1.什么是服务器？什么是云服务器 12345服务器是一种计算机硬件或软件，它可以为其他程序或设备（称为“客户端”）提供功能。这种架构叫做客户端-服务器模型。服务器可以提供各种功能，通常称为“服务”，比如在多个客户端之间共享数据或资源，或者为客户端执行计算。A server is a software or hardware device that accepts and responds to requests made over a network. The device that makes the request, and receives a response from the server, is called a client.云服务器是一种基于互联网的虚拟化技术，它可以将物理服务器的资源划分成多个独立的虚拟服务器，并按需分配给用户。云服务器可以实现弹性伸缩，按使用量付费，高可用性等优势。 服务器可以理解成电脑？云服务器可以理解成远端的电脑吗? 1您的理解是基本正确的。服务器可以理解成一种特殊的电脑，它可以为其他电脑或设备提供服务。云服务器可以理解成远端的虚拟电脑，它可以通过互联网访问和使用。 2.请问网站服务器和文件服务器有什么区别？请给我介绍更多的细节？ 12345服务器是一种计算机，它可以处理请求并向另一台计算机提供数据或资源。服务器有很多种类，根据它们提供的服务不同，可以分为网站服务器，文件服务器，邮件服务器等等。网站服务器是一种可以托管网页的服务器，它可以让用户通过浏览器访问网站的内容。比如，当您在浏览器中输入 www.bing.com 时，您就是在请求网站服务器上的一个网页。文件服务器是一种可以存储和共享文件的服务器，它可以让用户在网络上方便地访问和管理文件。比如，当您在电脑上打开一个网络驱动器时，您就是在访问文件服务器上的一个文件夹。 3.如何将我自己的电脑变成一台网络服务器呢? 123456789将您自己的电脑变成一台网络服务器的方法有以下几个步骤：1.选择一台适合做网络服务器的电脑，它应该有足够的硬件配置，稳定的网络连接，和安全的防火墙设置。2.下载并安装一个好的网络服务器软件，比如 Apache ， IIS ， Nginx 等。根据您的需要，选择合适的操作系统和版本。3.配置您的网络服务器软件，设置一些参数和选项，比如端口号，根目录，日志文件等。您也可以安装一些扩展模块或插件来增加功能。4.创建一个基本的主页来测试服务器是否正常工作。您可以用 HTML 或其他语言编写一个简单的网页，并保存在服务器的根目录下。5.检查您是否可以从 http://127.0.0.1/ 访问到您的网站。这是您电脑上的本地地址，只有您自己可以看到。6.让一个朋友从 http://yourWANip/ 测试您的网站是否可以被外部访问。这是您电脑在互联网上的公共地址，其他人可以通过它访问到您的网站。如果不能访问，请检查您的路由器和防火墙设置是否正确。7.购买一个域名并将它指向您的公共地址。这样，用户就可以通过一个易记和友好的名称来访问您的网站了。 备注：网络服务器的作用就是将自己的网站上传到此，别人可以访问了。","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://github.com/Qiyongchuan/hexopp/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}]},{"title":"前端笔记整理（一）","date":"2023-03-07T04:10:24.000Z","path":"/2023/03/07/前端面试题整理/","excerpt":"1.HTML 部分单标签有哪些？ 1234&lt;img&gt;&lt;hr&gt;&lt;br&gt; 1.1HTML基础知识点 Html5 与 html4的区别： html5新增语义化标签，如 等 Html5新增表单控件，如&lt;input type=&quot;date&quot;&gt; &lt;input type=&quot;color&quot;&gt;等 Html5新增多媒体标签，如&lt;video&gt;、&lt;audio&gt;等 2.HTML基础标签 123456789* 标题标签 &lt;h1&gt; &lt;h6&gt;* 段落标签 &lt;p&gt;* 链接标签 &lt;a&gt;* 图片标签 &lt;img&gt;* 列表标签 &lt;ul&gt; &lt;ol&gt;","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://github.com/Qiyongchuan/hexopp/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"},{"name":"前端笔记","slug":"前端笔记","permalink":"https://github.com/Qiyongchuan/hexopp/tags/%E5%89%8D%E7%AB%AF%E7%AC%94%E8%AE%B0/"}]},{"title":"SpringBoot （一）","date":"2023-03-04T13:29:24.000Z","path":"/2023/03/04/Spring-Boot/","excerpt":"（一）如何创建maven项目 1本系列主要记录在javaee课上学习到的SpringBoot的知识点及遇到的问题。 1.创建maven项目项目管理工具，meven。源代码管理、测试、发布….. 1.1 maven项目目录结构12345678910|--src​ |--main //项目发布的源代码 |--java //项目的java代码 |-- resources //项目中除了java代码之外的所有资源文件。html页面，js​ | --test //项目测试的源代码 |--java |--resource|--pom.xml //meaven的配置文件 1.2 pom.xml配置文件 meven的配置文件 1.2.1属性模块","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://github.com/Qiyongchuan/hexopp/tags/%E5%AD%A6%E4%B9%A0%E7%AC%94%E8%AE%B0/"}]},{"title":"完成比完美更重要——记一次差点挂科的经历","date":"2023-03-03T08:59:50.000Z","path":"/2023/03/03/被所谓的完美主义搞到崩溃/","excerpt":"上周终于考完了上学期要缓考的四科考试，度过了一个非常崩溃、内耗，又很失败的一周，最崩溃的一天从中午考到了晚上。虽然前一天特意通宵复习，但没用，到了考场看到试卷的那一刻，大脑完全空白，彻底失败。 那一刻，证明了弯道超车真的胡扯。某一瞬间，脑子里不断重复：要是去年没缓考，在家网上考试多好！ 或许，我应该把这句话刻在我的墓志铭上提醒后代（要是有的话）：别缓考，假期前学不完的东西，假期后也一样。 当时缓考的理由有这么几个：一是自己没复习好，想考好；二是自己想好好学，但在家考就可以用手机搜一搜啥的了，不必好好学了（； 三是自己当时阳了；综上，我毅然决然选择了缓考….. 结果，唉，差点害死自己。 教训是想考高分不一定要去完完全全了解这个学科的知识点，刷题背题就完了； 下次有方便的路别再折腾自己了，拖延和内耗会不断的折磨自己，行动是解救自己的唯一良药。 不完美的行动比不行动要强一百倍，不完美的计划也是计划，千万不要在脑子里想一遍又一遍到头来什么都没有了。","tags":[{"name":"Essay","slug":"Essay","permalink":"https://github.com/Qiyongchuan/hexopp/tags/Essay/"}]},{"title":"集线器、交换机和路由器的区别","date":"2023-02-26T09:05:30.000Z","path":"/2023/02/26/路由、交換機/","excerpt":"集线器、交换机和路由器的区别（The differences bettwen Switch Router and Hub） 集线器（hub），当一台电脑发送给另一台电脑数据包时，所有端口上连接的电脑都能收到数据包，同时会造成网络的拥堵，极大浪费了带宽。 hub that every computer connectd can received the data packet. 交换机(switch)，与集线器类似，但更智能。可以解析每一台设备的ip地址（称为MAC 地址），只向特定端口的设备发送数据包。 路由器，连接不同网络，可以理解成不同网络之间的大门（gateway） A router is a device that routes or fowards data from one network to another based on their IP address. When a data packet is received from the router,the router inspects the data’s IP address and determines if the packet was meant for its own network or if its meant for another network. If the routerdetermines that the data packet is meant for its own network,it receives it. But if it’s not meant for it’s own network, it sends it off to another network.","tags":[{"name":"notes","slug":"notes","permalink":"https://github.com/Qiyongchuan/hexopp/tags/notes/"}]},{"title":"ChatGPT、研究生退学、农业与技术","date":"2023-02-26T08:59:50.000Z","path":"/2023/02/26/ChatGPT、研究生/","excerpt":"本打算在2.24号发出的，但各种原因，拖了又拖，到了2.26号。当时想表达的意思与心境早已快忘记了，但晚写总归比没有要强，于是我在一个阳光很好的午后，本该为下周到来的6科考试复习（我总是拧巴着拖延和逃避）时，坐在学校的山坡上，随便写点什么东西。 研究生退学先从研究生退学聊起吧。有些时候感觉自己讲了太多遍反而自己都有些烦了，姑且像祥林嫂那样再讲一遍：2022.2.24日，在普京调集他的军队入侵乌克兰的那天，1小时22分速通基辅（邵依古在平行世界里一战封神）的这天，在也是我研究生正式提交退学申请的这天。 后来普京的军队在无数个1小时22分里都没有彻底拿下乌克兰，陷入了泥潭里。我退学后的境况竟和他们命运一样，在经过了数次“三个月自学完前端的计划”破产之后，我也没能实现退学前的预定目标。 于是，在各种阴差阳错之后，我又幸运的重新回到了校园，读了一个计算机二学位。 以上恰巧也发生在了我的二十四岁本命年中，我的人生轨迹似乎发生了变化。至于最终会偏向哪里，只能等后来看了。 ChatGPT最初想写一篇文章，其实主要是因某节课上所看教材有感。在2023年的今天，我们计算机的学生所看的教材，课本上的文件日期显示的竟然是2016年的，所用的软件也基本上是停止更新，被淘汰的。在谷歌上输入该软件，被问到的问题是：“Is xx still used 2022?” 若在农业的教科书中，教材十几年不变影响倒还不算大（毕竟基础学科变化不大），但计算机领域，几年的时间技术都会发生翻天覆地的变化。但学习一个被淘汰的软件，在这里成了一门必修课。 btw，纠结这些实际意义也并没有多大的意义，只是限于了技术绝对论的谈论中了。总会有最新的技术，总会有最新的软件，淘汰旧的技术，或者”迷信技术的人“。（当然这是另一个方面了，总不能学淘汰的软件吧：）","tags":[{"name":"Essay","slug":"Essay","permalink":"https://github.com/Qiyongchuan/hexopp/tags/Essay/"}]},{"title":"如何使用hexo？","date":"2023-02-23T09:30:11.000Z","path":"/2023/02/23/如何使用hexo？/","excerpt":"注：本文是在完成前期一系列初始化建立博客工作后，如何使用。 写本文原因主要是源于：我忘记怎么发文章了。 1&#x2F;首先找到自己在电脑上创建的Blog的文件夹。 (为防止我再一次忘记，这次直接将文件件放到了桌面。) 2&#x2F;到所在文件夹后，鼠标右键点击“在终端中打开” 3&#x2F;code . 命令可在vscode中打开，cd test进入博客中之前创建的文件夹 4&#x2F;此时，可以继续在命令行中输入 hexo new “文章的标题” ，创建一篇新的post了，在vscode中打开就可以编辑。 或者，直接在Typora中编辑好后，保存文件后将文件直接放到source&#x2F;_posts中即可。 5&#x2F;以上步骤完成“从哪里打开——如何写”的步骤。[新掌握的一个技巧从文章中插入图片] 在source文件夹中创建images文件夹[修改,需要直接在source文件夹中]，将需要的图片放进入，直接将图片拖入文章中，便可以自动设置路径。但更好的方式应该是设置外部链接：","tags":[{"name":"notes","slug":"notes","permalink":"https://github.com/Qiyongchuan/hexopp/tags/notes/"}]},{"title":"How do you trick your brain into doing difficult things","date":"2023-02-09T15:26:58.000Z","path":"/2023/02/09/dopamine/","excerpt":"How do you trick your brain into doing difficult thingsYou probably don’t have a problem playing video games or browsing social media on your phone. In fact I have no doubt you could sit in front of a screen and do both of those activities for 2 hours,or enev longer without breaking your concentration. But what about half an hour of studying? Ops! That might too hard.How about working on your side business for another hour? Huum.Doesn’t sound too appealing. Even though you logically know that studying,exercising,building a busniss or something equally productive will bring you more things in the long run, you’ll still prefer watching TV,playing video games and scrolling through social media. One might argue that it’s obvious why. One activity is easy and doesn’t require much effort,while the other activity is difficult.. and it’s requires you to apply yourself. But some people seem to have no problem studying,exercising or woring on their side projects,regularly.Which begs the question: Why some people more motivated to tackle difficult things? And is there a way to make doing difficult things easy? To answer this question,we need to look at this brain neurotransmitter:Dopamine. Dopamine is often considered a pleasure moloculd. But that’s not quite what it does. Dopamine is what make us desire things. And it’s that desire that gives us the motivation to get up and do stuff. If you not sure how powerful dopamine is,let me introduce you to a few experiments neuroscientists did on rats. The researchers implanted electrodes in the brains of rats. Whenever the rat pulled a lever,the researchers stimulated the rat’s reward system in the brain. The result was that the rats developed a craving so stron, they kept pulling the lever, over and over for hours. The rats would refuse to eat or even sleep. They would just keep pressing the lever until they would drop from exhaustion. But then the process was reversed. The researchers blocked the release of dopamine in the brain’s reward center. As a result,rats became so lethargic that even getting up to get a drink of water was not worth the effort. They would’t eat. They didn’t want to mate. They didn’t crave anything at all. You could say that rats lost all will to live. However, if food was placed directly in their miuths, the rats would still eat and enjoy the food. They just didn’t have the motivationg to get up and do it themselves. You would think that it’s thirst or hunger that motivates us get food or water. But there’s alse dopamine that plays a key role here. Those rats experients might be extreme cases. But you can see similar effects dopamine has in humans and in our daily lives. In fact, your brain develops priorities in large part based on how much dopamine it’s expecting to get. If an activity releases too little dopamine, you won’t have much motivation to do it. But if an activity release a lot of dopamine, you’ll be motivited to repeat it over and over.","tags":[{"name":"Essay","slug":"Essay","permalink":"https://github.com/Qiyongchuan/hexopp/tags/Essay/"}]},{"title":"Markdown","date":"2023-02-09T12:30:38.000Z","path":"/2023/02/09/Markdown/","excerpt":"markdown 语法标题一标题二标题三标题四标题五 ** 这是斜体 ** 这是横线 引用https://markdown-zh.readthedocs.io/","tags":[{"name":"notes","slug":"notes","permalink":"https://github.com/Qiyongchuan/hexopp/tags/notes/"}]},{"title":"Hello World ！","date":"2023-02-09T12:21:00.232Z","path":"/2023/02/09/hello-world/","excerpt":"Welcome to my world !","tags":[]}]